## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_route53_record.branch-review-apps-cds-snc-ca-A`      |
|        | `aws_route53_record.web-templates-pspc-alpha-canada-ca-A` |
| update | `aws_iam_role.notify_prod_dns_manager`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.notify_prod_dns_manager will be updated in-place
  ~ resource "aws_iam_role" "notify_prod_dns_manager" {
      ~ assume_role_policy    = (sensitive value)
        id                    = "notify_prod_dns_manager"
        name                  = "notify_prod_dns_manager"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_route53_record.branch-review-apps-cds-snc-ca-A will be created
  + resource "aws_route53_record" "branch-review-apps-cds-snc-ca-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "branch-review-apps.cds-snc.ca"
      + records         = [
          + "35.202.225.254",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.web-templates-pspc-alpha-canada-ca-A will be created
  + resource "aws_route53_record" "web-templates-pspc-alpha-canada-ca-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "web-templates.pspc.alpha.canada.ca"
      + records         = [
          + "52.237.15.42",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
